Repository: ompatilbackup22-eng/Krushimitr
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi, mr

source: Home
hi: होम
mr: मुख्यपृष्ठ

source: About
hi: हमारे बारे में
mr: आमच्याबद्दल

source: Login
hi: लॉगिन
mr: लॉगिन

source: Register
hi: रजिस्टर
mr: नोंदणी

source: Dashboard
hi: डैशबोर्ड
mr: डॅशबोर्ड

source: Profile
hi: प्रोफाइल
mr: प्रोफाइल

source: Logout
hi: लॉगआउट
mr: लॉगआउट

source: Language
hi: भाषा
mr: भाषा

source: English
hi: अंग्रेजी
mr: इंग्रजी

source: Hindi
hi: हिन्दी
mr: हिंदी

source: Marathi
hi: मराठी
mr: मराठी

source: KrishiMitra: Agriband
hi: कृषिमित्र: एग्रीबैंड
mr: कृषिमित्र: एग्रीबँड

source: Smart Farming Decision Support System
hi: स्मार्ट फार्मिंग निर्णय सहायता प्रणाली
mr: स्मार्ट शेती निर्णय समर्थन प्रणाली

source: Empowering farmers with smart technology for better crop yields and sustainable farming practices.
hi: बेहतर फसल उत्पादन और सतत कृषि प्रथाओं के लिए स्मार्ट तकनीक के साथ किसानों को सशक्त बनाना।
mr: चांगल्या पिकाच्या उत्पादनासाठी आणि टिकाऊ शेती पद्धतींसाठी स्मार्ट तंत्रज्ञानाने शेतकऱ्यांना सक्षम करणे.

source: Get Started
hi: शुरू करें
mr: सुरु करा

source: Go to Dashboard
hi: डैशबोर्ड पर जाएं
mr: डॅशबोर्डवर जा

source: Smart Farming Made Simple
hi: स्मार्ट फार्मिंग को सरल बनाया
mr: स्मार्ट शेती सोपी केली

source: Key Features
hi: मुख्य विशेषताएं
mr: मुख्य वैशिष्ट्ये

source: Soil Analysis
hi: मिट्टी विश्लेषण
mr: मातीचे विश्लेषण

source: Get detailed soil analysis and recommendations
hi: विस्तृत मिट्टी विश्लेषण और सुझाव प्राप्त करें
mr: तपशीलवार मातीचे विश्लेषण आणि शिफारसी मिळवा

source: Weather Monitoring
hi: मौसम निगरानी
mr: हवामान निरीक्षण

source: Real-time weather data and forecasts
hi: रियल-टाइम मौसम डेटा और पूर्वानुमान
mr: रिअल-टाइम हवामान डेटा आणि अंदाज

source: Crop Recommendations
hi: फसल सुझाव
mr: पिकाच्या शिफारसी

source: AI-powered crop suggestions based on your data
hi: आपके डेटा के आधार पर AI-संचालित फसल सुझाव
mr: तुमच्या डेटावर आधारित AI-चालित पीक सुझाव

source: Expert Support
hi: विशेषज्ञ सहायता
mr: तज्ञ सहाय्य

source: Connect with agricultural experts
hi: कृषि विशेषज्ञों से जुड़ें
mr: कृषी तज्ञांशी जोडा

source: How It Works
hi: यह कैसे काम करता है
mr: हे कसे काम करते

source: Add Your Data
hi: अपना डेटा जोड़ें
mr: तुमचा डेटा जोडा

source: Enter soil test results and weather information
hi: मिट्टी परीक्षण परिणाम और मौसम जानकारी दर्ज करें
mr: मातीच्या चाचणीचे निकाल आणि हवामान माहिती प्रविष्ट करा

source: Get Analysis
hi: विश्लेषण प्राप्त करें
mr: विश्लेषण मिळवा

source: Receive detailed analysis and insights
hi: विस्तृत विश्लेषण और अंतर्दृष्टि प्राप्त करें
mr: तपशीलवार विश्लेषण आणि अंतर्दृष्टी मिळवा

source: Follow Recommendations
hi: सुझावों का पालन करें
mr: शिफारसी पाळा

source: Implement suggested farming practices
hi: सुझावित कृषि प्रथाओं को लागू करें
mr: सुझावित शेती पद्धतींची अंमलबजावणी करा

source: Follow Calendar
hi: कैलेंडर का पालन करें
mr: कॅलेंडर पाळा

source: Use the crop calendar and alerts for optimal farming
hi: इष्टतम कृषि के लिए फसल कैलेंडर और अलर्ट का उपयोग करें
mr: इष्टतम शेतीसाठी पीक कॅलेंडर आणि अलर्ट वापरा

source: Ready to Start Smart Farming?
hi: स्मार्ट फार्मिंग शुरू करने के लिए तैयार हैं?
mr: स्मार्ट शेती सुरू करण्यास तयार आहात?

source: Join thousands of farmers who are already using KrishiMitra to improve their yields
hi: हजारों किसानों में शामिल हों जो पहले से ही अपनी उपज में सुधार के लिए कृषिमित्र का उपयोग कर रहे हैं
mr: हजारो शेतकऱ्यांमध्ये सामील व्हा जे आधीच कृषिमित्र वापरून त्यांचे उत्पादन सुधारत आहेत

source: Register Now
hi: अभी रजिस्टर करें
mr: आता नोंदणी करा

source: About KrishiMitra: Agriband
hi: कृषिमित्र: एग्रीबैंड के बारे में
mr: कृषिमित्र: एग्रीबँड बद्दल

source: Our Mission
hi: हमारा मिशन
mr: आमचे मिशन

source: To empower farmers with smart technology and data-driven insights for sustainable and profitable farming practices.
hi: टिकाऊ और लाभदायक कृषि प्रथाओं के लिए स्मार्ट तकनीक और डेटा-संचालित अंतर्दृष्टि के साथ किसानों को सशक्त बनाना।
mr: टिकाऊ आणि नफ्याच्या शेती पद्धतींसाठी स्मार्ट तंत्रज्ञान आणि डेटा-चालित अंतर्दृष्टीसह शेतकऱ्यांना सक्षम करणे.

source: Our Vision
hi: हमारा दृष्टिकोण
mr: आमचे दृष्टीकोन

source: A world where every farmer has access to smart farming tools and knowledge to maximize their agricultural potential.
hi: एक ऐसी दुनिया जहां हर किसान के पास अपनी कृषि क्षमता को अधिकतम करने के लिए स्मार्ट फार्मिंग उपकरण और ज्ञान तक पहुंच हो।
mr: एक जग जिथे प्रत्येक शेतकऱ्याला त्यांच्या कृषी क्षमतेचा जास्तीत जास्त फायदा घेण्यासाठी स्मार्ट शेती साधने आणि ज्ञान उपलब्ध आहे.

source: Advanced Soil Analysis
hi: उन्नत मिट्टी विश्लेषण
mr: प्रगत मातीचे विश्लेषण

source: Comprehensive soil testing and nutrient analysis for optimal crop planning.
hi: इष्टतम फसल योजना के लिए व्यापक मिट्टी परीक्षण और पोषक तत्व विश्लेषण।
mr: इष्टतम पीक नियोजनासाठी व्यापक मातीच्या चाचणी आणि पोषक तत्वांचे विश्लेषण.

source: Weather Intelligence
hi: मौसम बुद्धिमत्ता
mr: हवामान बुद्धिमत्ता

source: Real-time weather monitoring and predictive analytics for better decision making.
hi: बेहतर निर्णय लेने के लिए रियल-टाइम मौसम निगरानी और भविष्यवाणी विश्लेषण।
mr: चांगल्या निर्णय घेण्यासाठी रिअल-टाइम हवामान निरीक्षण आणि भविष्यसूचक विश्लेषण.

source: AI-Powered Recommendations
hi: AI-संचालित सुझाव
mr: AI-चालित शिफारसी

source: Machine learning algorithms provide personalized crop and farming recommendations.
hi: मशीन लर्निंग एल्गोरिदम व्यक्तिगत फसल और कृषि सुझाव प्रदान करते हैं।
mr: मशीन लर्निंग अल्गोरिदम वैयक्तिकृत पीक आणि शेती शिफारसी प्रदान करतात.

source: Direct access to agricultural experts and extension services.
hi: कृषि विशेषज्ञों और विस्तार सेवाओं तक प्रत्यक्ष पहुंच।
mr: कृषी तज्ञ आणि विस्तार सेवांमध्ये थेट प्रवेश.

source: Why Choose KrishiMitra?
hi: कृषिमित्र क्यों चुनें?
mr: कृषिमित्र का निवडा?

source: Data-Driven Decisions
hi: डेटा-संचालित निर्णय
mr: डेटा-चालित निर्णय

source: Make informed farming decisions based on scientific data and analysis.
hi: वैज्ञानिक डेटा और विश्लेषण के आधार पर सूचित कृषि निर्णय लें।
mr: वैज्ञानिक डेटा आणि विश्लेषणावर आधारित सूचित शेती निर्णय घ्या.

source: Cost Effective
hi: लागत प्रभावी
mr: खर्च-प्रभावी

source: Reduce input costs and increase yields through optimized farming practices.
hi: इष्टतम कृषि प्रथाओं के माध्यम से इनपुट लागत कम करें और उपज बढ़ाएं।
mr: इष्टतम शेती पद्धतींद्वारे इनपुट खर्च कमी करा आणि उत्पादन वाढवा.

source: Sustainable Farming
hi: टिकाऊ कृषि
mr: टिकाऊ शेती

source: Promote environmentally friendly and sustainable agricultural practices.
hi: पर्यावरण के अनुकूल और टिकाऊ कृषि प्रथाओं को बढ़ावा दें।
mr: पर्यावरण-अनुकूल आणि टिकाऊ कृषी पद्धतींना प्रोत्साहन द्या.

source: Easy to Use
hi: उपयोग में आसान
mr: वापरण्यास सोपे

source: User-friendly interface designed for farmers of all technical levels.
hi: सभी तकनीकी स्तरों के किसानों के लिए डिज़ाइन किया गया उपयोगकर्ता-अनुकूल इंटरफेस।
mr: सर्व तांत्रिक स्तरांच्या शेतकऱ्यांसाठी डिझाइन केलेले वापरकर्ता-अनुकूल इंटरफेस.

source: Get Started Today
hi: आज ही शुरू करें
mr: आजच सुरु करा

source: Join thousands of farmers who are already benefiting from KrishiMitra's smart farming solutions.
hi: हजारों किसानों में शामिल हों जो पहले से ही कृषिमित्र के स्मार्ट फार्मिंग समाधानों से लाभान्वित हो रहे हैं।
mr: हजारो शेतकऱ्यांमध्ये सामील व्हा जे आधीच कृषिमित्रच्या स्मार्ट शेती उपायांपासून लाभान्वित होत आहेत.

source: Welcome back, %(name)s!
hi: वापस स्वागत है, %(name)s!
mr: परत स्वागत आहे, %(name)s!

source: Here's your farming overview for today
hi: आज के लिए आपका कृषि अवलोकन
mr: आजच्या दिवसासाठी तुमचा शेती अवलोकन

source: Quick Stats
hi: त्वरित आंकड़े
mr: द्रुत आकडेवारी

source: Latest Soil Data
hi: नवीनतम मिट्टी डेटा
mr: नवीनतम मातीचा डेटा

source: Latest Weather Data
hi: नवीनतम मौसम डेटा
mr: नवीनतम हवामान डेटा

source: Active Recommendations
hi: सक्रिय सुझाव
mr: सक्रिय शिफारसी

source: View Details
hi: विवरण देखें
mr: तपशील पहा

source: No recent data available
hi: कोई हालिया डेटा उपलब्ध नहीं
mr: कोणताही अलीकडील डेटा उपलब्ध नाही

source: Add your first data to get started
hi: शुरू करने के लिए अपना पहला डेटा जोड़ें
mr: सुरु करण्यासाठी तुमचा पहिला डेटा जोडा

source: Pending Alerts
hi: लंबित अलर्ट
mr: प्रलंबित अलर्ट

source: View All Alerts
hi: सभी अलर्ट देखें
mr: सर्व अलर्ट पहा

source: Quick Actions
hi: त्वरित कार्य
mr: द्रुत क्रिया

source: Add Soil Data
hi: मिट्टी डेटा जोड़ें
mr: मातीचा डेटा जोडा

source: Add Weather Data
hi: मौसम डेटा जोड़ें
mr: हवामान डेटा जोडा

source: Get Recommendations
hi: सुझाव प्राप्त करें
mr: शिफारसी मिळवा

source: View Reports
hi: रिपोर्ट देखें
mr: अहवाल पहा

source: Soil Data Management
hi: मिट्टी डेटा प्रबंधन
mr: मातीच्या डेटाचे व्यवस्थापन

source: No Soil Data Available
hi: कोई मिट्टी डेटा उपलब्ध नहीं
mr: कोणताही मातीचा डेटा उपलब्ध नाही

source: Start by adding your first soil test data to get personalized recommendations.
hi: व्यक्तिगत सुझाव प्राप्त करने के लिए अपना पहला मिट्टी परीक्षण डेटा जोड़कर शुरू करें।
mr: वैयक्तिकृत शिफारसी मिळविण्यासाठी तुमचा पहिला मातीच्या चाचणीचा डेटा जोडून सुरुवात करा.

source: Are you sure you want to delete this soil data?
hi: क्या आप वाकई इस मिट्टी डेटा को हटाना चाहते हैं?
mr: तुम्हाला खरोखर हा मातीचा डेटा हटवायचा आहे का?

source: My Crop Recommendations
hi: मेरे फसल सुझाव
mr: माझ्या पिकाच्या शिफारसी

source: Get New Recommendations
hi: नए सुझाव प्राप्त करें
mr: नवीन शिफारसी मिळवा

source: Compatibility Score
hi: संगतता स्कोर
mr: सुसंगतता स्कोअर

source: Season
hi: मौसम
mr: हंगाम

source: Duration
hi: अवधि
mr: कालावधी

source: Recommended on
hi: सुझाव दिया गया
mr: शिफारस केले

source: View Calendar
hi: कैलेंडर देखें
mr: कॅलेंडर पहा

source: No Crop Recommendations Yet
hi: अभी तक कोई फसल सुझाव नहीं
mr: अद्याप कोणताही पीक शिफारस नाही

source: Get personalized crop recommendations based on your soil and weather data.
hi: अपने मिट्टी और मौसम डेटा के आधार पर व्यक्तिगत फसल सुझाव प्राप्त करें।
mr: तुमच्या माती आणि हवामान डेटावर आधारित वैयक्तिकृत पीक शिफारसी मिळवा.

source: Welcome Back
hi: वापस स्वागत है
mr: परत स्वागत आहे

source: Sign in to your KrishiMitra account
hi: अपने कृषिमित्र खाते में साइन इन करें
mr: तुमच्या कृषिमित्र खात्यात साइन इन करा

source: Mobile Number
hi: मोबाइल नंबर
mr: मोबाइल नंबर

source: Password
hi: पासवर्ड
mr: पासवर्ड

source: Sign In
hi: साइन इन करें
mr: साइन इन करा

source: Don't have an account? Register here
hi: खाता नहीं है? यहां रजिस्टर करें
mr: खाते नाही? येथे नोंदणी करा

source: Create Account
hi: खाता बनाएं
mr: खाते तयार करा

source: Join KrishiMitra and start smart farming
hi: कृषिमित्र में शामिल हों और स्मार्ट फार्मिंग शुरू करें
mr: कृषिमित्रमध्ये सामील व्हा आणि स्मार्ट शेती सुरू करा

source: Full Name
hi: पूरा नाम
mr: पूर्ण नाव

source: Village
hi: गांव
mr: गाव

source: Tehsil
hi: तहसील
mr: तालुका

source: District
hi: जिला
mr: जिल्हा

source: State
hi: राज्य
mr: राज्य

source: Already have an account? Login here
hi: पहले से खाता है? यहां लॉगिन करें
mr: आधीच खाते आहे? येथे लॉगिन करा

source: Pincode
hi: पिनकोड
mr: पिनकोड

source: Confirm Password
hi: पासवर्ड की पुष्टि करें
mr: पासवर्डची पुष्टी करा

source: Crop Knowledge Base
hi: फसल ज्ञान आधार
mr: पीक ज्ञान आधार

source: Comprehensive information about different crops and their requirements
hi: विभिन्न फसलों और उनकी आवश्यकताओं के बारे में व्यापक जानकारी
mr: विविध पिकांबद्दल आणि त्यांच्या आवश्यकतांबद्दल व्यापक माहिती

source: All Seasons
hi: सभी मौसम
mr: सर्व हंगाम

source: Kharif
hi: खरीफ
mr: खरीप

source: Rabi
hi: रबी
mr: रबी

source: Summer
hi: गर्मी
mr: उन्हाळा

source: days
hi: दिन
mr: दिवस

source: pH Range
hi: pH सीमा
mr: pH श्रेणी

source: Temperature
hi: तापमान
mr: तापमान

source: Moisture
hi: नमी
mr: ओलावा

source: Nutrient Requirements
hi: पोषक तत्व आवश्यकताएं
mr: पोषक तत्वांच्या आवश्यकता

source: No Crops Available
hi: कोई फसल उपलब्ध नहीं
mr: कोणतेही पीक उपलब्ध नाही

source: Crop information will be available soon.
hi: फसल जानकारी जल्द ही उपलब्ध होगी।
mr: पीक माहिती लवकरच उपलब्ध होईल.

source: Weather Data Management
hi: मौसम डेटा प्रबंधन
mr: हवामान डेटा व्यवस्थापन

source: Fetch Weather
hi: मौसम डेटा प्राप्त करें
mr: हवामान डेटा मिळवा

source: No Weather Data Available
hi: कोई मौसम डेटा उपलब्ध नहीं
mr: कोणताही हवामान डेटा उपलब्ध नाही

source: Add weather data to get accurate crop recommendations.
hi: सटीक फसल सुझाव प्राप्त करने के लिए मौसम डेटा जोड़ें।
mr: अचूक पिकाच्या शिफारसी मिळविण्यासाठी हवामान डेटा जोडा.

source: Weather Forecast & Analysis
hi: मौसम पूर्वानुमान और विश्लेषण
mr: हवामान अंदाज आणि विश्लेषण

source: Based on recent weather patterns and trends
hi: हाल के मौसम पैटर्न और प्रवृत्तियों के आधार पर
mr: अलीकडील हवामान पॅटर्न आणि प्रवृत्तींवर आधारित

source: Current Weather Conditions
hi: वर्तमान मौसम की स्थिति
mr: सध्याची हवामान स्थिती

source: Trend
hi: प्रवृत्ति
mr: प्रवृत्ती

source: Weather-Based Recommendations
hi: मौसम-आधारित सुझाव
mr: हवामान-आधारित शिफारसी

source: Recent Weather History
hi: हाल का मौसम इतिहास
mr: अलीकडील हवामान इतिहास

source: Date
hi: तारीख
mr: तारीख

source: Actions
hi: कार्य
mr: क्रिया

source: Get Crop Recommendations
hi: फसल सुझाव प्राप्त करें
mr: पिकाच्या शिफारसी मिळवा

source: Back to Weather Data
hi: मौसम डेटा पर वापस जाएं
mr: हवामान डेटाकडे परत जा

source: Enter current weather conditions
hi: वर्तमान मौसम की स्थिति दर्ज करें
mr: सध्याची हवामान स्थिती प्रविष्ट करा

source: Range: -50°C to 50°C
hi: सीमा: -50°C से 50°C
mr: श्रेणी: -50°C ते 50°C

source: Range: 0-100%
hi: सीमा: 0-100%
mr: श्रेणी: 0-100%

source: Amount of rainfall in millimeters
hi: मिलीमीटर में वर्षा की मात्रा
mr: मिलिमीटरमध्ये पाऊसाचे प्रमाण

source: Submit
hi: जमा करें
mr: सबमिट करा

source: Weather Data Details
hi: मौसम डेटा विवरण
mr: हवामान डेटा तपशील

source: Forecast
hi: पूर्वानुमान
mr: अंदाज

source: Back to List
hi: सूची पर वापस जाएं
mr: यादीकडे परत जा

source: Weather Conditions
hi: मौसम की स्थिति
mr: हवामान स्थिती

source: Cool
hi: ठंडा
mr: थंड

source: Hot
hi: गर्म
mr: गरम

source: Moderate
hi: मध्यम
mr: मध्यम

source: Dry
hi: सूखा
mr: कोरडे

source: Wet
hi: गीला
mr: ओले

source: Normal
hi: सामान्य
mr: सामान्य

source: Low
hi: कम
mr: कमी

source: High
hi: उच्च
mr: उच्च

source: Are you sure you want to delete this weather data?
hi: क्या आप वाकई इस मौसम डेटा को हटाना चाहते हैं?
mr: तुम्हाला खरोखर हा हवामान डेटा हटवायचा आहे का?

source: Save Weather Data
hi: मौसम डेटा सहेजें
mr: हवामान डेटा जतन करा

source: Humid
hi: नम
mr: ओले

source: Comfortable
hi: आरामदायक
mr: आरामदायक

source: No Rain
hi: बारिश नहीं
mr: पाऊस नाही

source: Light Rain
hi: हल्की बारिश
mr: हलका पाऊस

source: Moderate Rain
hi: मध्यम बारिश
mr: मध्यम पाऊस

source: Heavy Rain
hi: भारी बारिश
mr: जोरदार पाऊस

source: Additional Information
hi: अतिरिक्त जानकारी
mr: अतिरिक्त माहिती

source: Recorded Date
hi: रिकॉर्ड की गई तारीख
mr: नोंदवलेली तारीख

source: Based on your soil and weather data for %(season)s season
hi: आपके मिट्टी और मौसम डेटा के आधार पर %(season)s मौसम के लिए
mr: तुमच्या माती आणि हवामान डेटावर आधारित %(season)s हंगामासाठी

source: Current Soil Conditions
hi: वर्तमान मिट्टी की स्थिति
mr: सध्याची मातीची स्थिती

source: Add to My Crops
hi: मेरी फसलों में जोड़ें
mr: माझ्या पिकांमध्ये जोडा

source: No Suitable Crops Found
hi: कोई उपयुक्त फसल नहीं मिली
mr: कोणतेही योग्य पीक सापडले नाही

source: Based on your current soil and weather conditions, no crops meet the minimum compatibility threshold.
hi: आपकी वर्तमान मिट्टी और मौसम की स्थिति के आधार पर, कोई भी फसल न्यूनतम संगतता सीमा को पूरा नहीं करती।
mr: तुमच्या सध्याच्या माती आणि हवामान स्थितीवर आधारित, कोणतेही पीक किमान सुसंगतता उंबरठा पूर्ण करत नाही.

source: Update Soil Data
hi: मिट्टी डेटा अपडेट करें
mr: मातीचा डेटा अपडेट करा

source: Update Weather Data
hi: मौसम डेटा अपडेट करें
mr: हवामान डेटा अपडेट करा

source: View All Crops
hi: सभी फसलें देखें
mr: सर्व पिके पहा

source: Back to Dashboard
hi: डैशबोर्ड पर वापस जाएं
mr: डॅशबोर्डवर परत जा

source: Alerts & Notifications
hi: अलर्ट और सूचनाएं
mr: अलर्ट आणि सूचना

source: Generate Alerts
hi: अलर्ट जेनरेट करें
mr: अलर्ट तयार करा

source: Upcoming Alerts
hi: आगामी अलर्ट
mr: आगामी अलर्ट

source: All Alerts
hi: सभी अलर्ट
mr: सर्व अलर्ट

source: Pending
hi: लंबित
mr: प्रलंबित

source: Completed
hi: पूर्ण
mr: पूर्ण

source: Get help from agricultural experts
hi: कृषि विशेषज्ञों से सहायता प्राप्त करें
mr: कृषी तज्ञांकडून मदत मिळवा

source: Ask a Question
hi: प्रश्न पूछें
mr: प्रश्न विचारा

source: Have a farming question? Our experts are here to help you.
hi: कृषि का कोई प्रश्न है? हमारे विशेषज्ञ आपकी मदद के लिए यहां हैं।
mr: शेतीचा प्रश्न आहे? आमचे तज्ञ तुम्हाला मदत करण्यासाठी येथे आहेत.

source: Submit Question
hi: प्रश्न जमा करें
mr: प्रश्न सबमिट करा

source: Frequently Asked Questions
hi: अक्सर पूछे जाने वाले प्रश्न
mr: वारंवार विचारले जाणारे प्रश्न

source: Find quick answers to common farming questions.
hi: सामान्य कृषि प्रश्नों के त्वरित उत्तर खोजें।
mr: सामान्य शेती प्रश्नांची द्रुत उत्तरे शोधा.

source: View FAQ
hi: FAQ देखें
mr: FAQ पहा

source: Educational Videos
hi: शैक्षिक वीडियो
mr: शैक्षणिक व्हिडिओ

source: Search Videos
hi: वीडियो खोजें
mr: व्हिडिओ शोधा

source: Best Management Practices (BMP) for smart farming
hi: स्मार्ट फार्मिंग के लिए सर्वोत्तम प्रबंधन प्रथाएं (BMP)
mr: स्मार्ट शेतीसाठी सर्वोत्तम व्यवस्थापन पद्धती (BMP)

source: All Categories
hi: सभी श्रेणियां
mr: सर्व श्रेण्या

source: Soil Management
hi: मिट्टी प्रबंधन
mr: माती व्यवस्थापन

source: Fertilizer Management
hi: उर्वरक प्रबंधन
mr: खत व्यवस्थापन

source: Irrigation
hi: सिंचाई
mr: सिंचन

source: Pest Management
hi: कीट प्रबंधन
mr: कीट व्यवस्थापन

source: Crop Management
hi: फसल प्रबंधन
mr: पीक व्यवस्थापन

source: Watch Video
hi: वीडियो देखें
mr: व्हिडिओ पहा

source: Reports & Analytics
hi: रिपोर्ट और विश्लेषण
mr: अहवाल आणि विश्लेषण

source: Generate comprehensive reports for your farming data
hi: अपने कृषि डेटा के लिए व्यापक रिपोर्ट जेनरेट करें
mr: तुमच्या शेती डेटासाठी व्यापक अहवाल तयार करा

source: No data
hi: कोई डेटा नहीं
mr: डेटा नाही

source: Enter your soil test results for analysis
hi: विश्लेषण के लिए अपने मिट्टी परीक्षण परिणाम दर्ज करें
mr: विश्लेषणासाठी तुमचे मातीच्या चाचणीचे निकाल प्रविष्ट करा

source: pH Level
hi: pH स्तर
mr: pH स्तर

source: Range: 0-14 (Optimal: 6.0-7.5)
hi: सीमा: 0-14 (इष्टतम: 6.0-7.5)
mr: श्रेणी: 0-14 (इष्टतम: 6.0-7.5)

source: Moisture Level
hi: नमी स्तर
mr: ओलावा स्तर

source: Nitrogen (N)
hi: नाइट्रोजन (N)
mr: नायट्रोजन (N)

source: Phosphorus (P)
hi: फॉस्फोरस (P)
mr: फॉस्फरस (P)

source: Potassium (K)
hi: पोटेशियम (K)
mr: पोटॅशियम (K)

source: Soil Type
hi: मिट्टी का प्रकार
mr: मातीचा प्रकार

source: Clay
hi: मिट्टी
mr: चिकणमाती

source: Sandy
hi: रेतली
mr: वाळूची

source: Loamy
hi: दोमट
mr: दोमट

source: Silty
hi: गाद
mr: गाळाची

source: Save Soil Data
hi: मिट्टी डेटा सहेजें
mr: मातीचा डेटा जतन करा

source: Crop Information
hi: फसल जानकारी
mr: पीक माहिती

source: Crop Name:
hi: फसल का नाम:
mr: पीक नाव:

source: Duration:
hi: अवधि:
mr: कालावधी:

source: Back to Crops
hi: फसलों पर वापस जाएं
mr: पिकांकडे परत जा

source: Upcoming Alerts (Next 7 Days)
hi: आगामी अलर्ट (अगले 7 दिन)
mr: आगामी अलर्ट (पुढील 7 दिवस)

source: Back to All Alerts
hi: सभी अलर्ट पर वापस जाएं
mr: सर्व अलर्टकडे परत जा

source: Contact Support
hi: सहायता से संपर्क करें
mr: सहाय्याशी संपर्क साधा

source: Get in touch with our support team
hi: हमारी सहायता टीम से संपर्क करें
mr: आमच्या सहाय्य टीमशी संपर्क साधा

source: Contact Information
hi: संपर्क जानकारी
mr: संपर्क माहिती

source: Email Support
hi: ईमेल सहायता
mr: ईमेल सहाय्य

source: Phone Support
hi: फोन सहायता
mr: फोन सहाय्य

source: Edit Profile
hi: प्रोफाइल संपादित करें
mr: प्रोफाइल संपादित करा

source: Back to Profile
hi: प्रोफाइल पर वापस जाएं
mr: प्रोफाइलकडे परत जा

source: Update Profile Information
hi: प्रोफाइल जानकारी अपडेट करें
mr: प्रोफाइल माहिती अपडेट करा

source: Keep your information up to date
hi: अपनी जानकारी को अपडेट रखें
mr: तुमची माहिती अद्ययावत ठेवा

source: Calendar
hi: कैलेंडर
mr: कॅलेंडर

source: active
hi: सक्रिय
mr: सक्रिय
